var qDB = [
  { 'q': '大熊猫的主要食物是什么?', 'ans': { 'a': '肉', 'b': '鱼', 'c': '竹子', 'd': '果子' }, 'r': 'c' },

  {
    'q': '世界上最高的山峰是哪座山?',
    'ans': { 'a': '珠穆朗玛峰', 'b': '干城章嘉峰', 'c': '马卡鲁峰', 'd': '乞力马扎罗山' },
    'r': 'a',
  },

  { 'q': '京都议定书的目标是保护什么?', 'ans': { 'a': '热带雨林', 'b': '淡水', 'c': '臭氧层', 'd': '沙漠' }, 'r': 'c' },

  {
    'q': '哪个国家拥有世界上最长的海岸线?',
    'ans': { 'a': '印度尼西亚', 'b': '美国', 'c': '中国', 'd': '加拿大' },
    'r': 'c',
  },

  { 'q': '世界上最大的鱼是哪一种?', 'ans': { 'a': '鲸鱼', 'b': '白鲨', 'c': '大马哈鱼', 'd': '蓝鲸' }, 'r': 'd' },

  { 'q': '世界上活动范围最大的猛禽是哪一种?', 'ans': { 'a': '金雕', 'b': '游隼', 'c': '苍鹰', 'd': '雕鸮' }, 'r': 'b' },

  {
    'q': '马达加斯加岛以哪些独特动物而著称?',
    'ans': { 'a': '树懒', 'b': '袋鼠', 'c': '狐猴', 'd': '无尾熊' },
    'r': 'c',
  },

  {
    'q': '哪个国家拥有最大的热带雨林?',
    'ans': { 'a': '巴西', 'b': '秘鲁', 'c': '马来西亚', 'd': '印度尼西亚' },
    'r': 'a',
  },

  {
    'q': '世界上海拔最高的淡水湖是哪个?',
    'ans': { 'a': '贡嘎湖', 'b': '泰塔卡卡湖', 'c': '托蒂卡卡湖', 'd': '麦克阿瑟湖' },
    'r': 'a',
  },

  {
    'q': '世界上最古老的湖泊是中国的哪个湖?',
    'ans': { 'a': '鄱阳湖', 'b': '洞庭湖', 'c': '鹤湖', 'd': '西湖' },
    'r': 'b',
  },
];
